In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv('968442106_T_T100D_MARKET_US_CARRIER_ONLY 2.csv')

In [5]:
data.head()

,PASSENGERS,DISTANCE,UNIQUE_CARRIER,AIRLINE_ID,UNIQUE_CARRIER_NAME,UNIQUE_CARRIER_ENTITY,REGION,CARRIER,CARRIER_NAME,CARRIER_GROUP,...,DEST_STATE_ABR,DEST_STATE_FIPS,DEST_STATE_NM,DEST_WAC,YEAR,QUARTER,MONTH,DISTANCE_GROUP,CLASS,Unnamed: 34
0,0,39,2O,20443,Island Air Service,06981,D,2O,Island Air Service,1,...,AK,2,Alaska,1,2014,1,1,1,F,NaN
1,0,78,2O,20443,Island Air Service,06981,D,2O,Island Air Service,1,...,AK,2,Alaska,1,2014,1,1,1,F,NaN
2,0,49,2O,20443,Island Air Service,06981,D,2O,Island Air Service,1,...,AK,2,Alaska,1,2014,1,1,1,F,NaN
3,0,30,2O,20443,Island Air Service,06981,D,2O,Island Air Service,1,...,AK,2,Alaska,1,2014,1,1,1,F,NaN
4,0,40,4E,20322,Tanana Air Service,06969,D,4E,Tanana Air Service,1,...,AK,2,Alaska,1,2014,1,1,1,F,NaN

In [6]:
data.shape

(256248, 35)

In [7]:
data['PASSENGERS'].sum()

664984910.0

In [9]:
data.columns

Index([u'PASSENGERS', u'DISTANCE', u'UNIQUE_CARRIER', u'AIRLINE_ID', u'UNIQUE_CARRIER_NAME', u'UNIQUE_CARRIER_ENTITY', u'REGION', u'CARRIER', u'CARRIER_NAME', u'CARRIER_GROUP', u'CARRIER_GROUP_NEW', u'ORIGIN_AIRPORT_ID', u'ORIGIN_AIRPORT_SEQ_ID', u'ORIGIN_CITY_MARKET_ID', u'ORIGIN', u'ORIGIN_CITY_NAME', u'ORIGIN_STATE_ABR', u'ORIGIN_STATE_FIPS', u'ORIGIN_STATE_NM', u'ORIGIN_WAC', u'DEST_AIRPORT_ID', u'DEST_AIRPORT_SEQ_ID', u'DEST_CITY_MARKET_ID', u'DEST', u'DEST_CITY_NAME', u'DEST_STATE_ABR', u'DEST_STATE_FIPS', u'DEST_STATE_NM', u'DEST_WAC', u'YEAR', u'QUARTER', u'MONTH', u'DISTANCE_GROUP', u'CLASS', u'Unnamed: 34'], dtype='object')

In [23]:
dest_cities = data.DEST_CITY_NAME.unique().tolist()
print str(len(dest_cities)) + ' destination cities'
dest_cities.sort()

orig_cities = data.ORIGIN_CITY_NAME.unique().tolist()
print str(len(orig_cities)) + ' origin cities'
orig_cities.sort()

1058 destination cities
1033 origin cities

In [133]:
grouped = data.groupby(['ORIGIN_CITY_NAME','DEST_CITY_NAME'])['PASSENGERS'].sum()

In [134]:
grouped.sort(ascending=False)

In [135]:
grouped = grouped.unstack(level=0)
grouped = grouped.fillna(0)

In [136]:
grouped.shape

(1058, 1033)

In [147]:
grouped['sum'] = grouped.sum()
grouped.sort('sum', ascending=False, inplace=True)

In [152]:
grouped['Aberdeen, SD'].sum()

26388.0

In [160]:
grouped.drop('sum', axis=1, inplace=True)

In [168]:
rows = grouped.sum(axis=0).order(ascending=False)

In [169]:
cols = grouped.sum(axis=1).order(ascending=False)

In [173]:
grouped = grouped.reindex_axis(rows.index, axis=0)
grouped = grouped.reindex_axis(cols.index, axis=1)

In [174]:
grouped.head()

DEST_CITY_NAME,"Atlanta, GA","Chicago, IL","Dallas/Fort Worth, TX","Los Angeles, CA","New York, NY","Denver, CO","Houston, TX","Charlotte, NC","Phoenix, AZ","Las Vegas, NV",...,"Mojave, CA","Sparrevohn, AK","Kuparuk, AK","Jackson, MS","Inyokern, CA","Gallup, NM","Fort Dix, NJ","Gaylord, MI","Gila Bend, AZ","Watsonville, CA"
ORIGIN_CITY_NAME,,,,,,,,,,,,,,,,,,,,,
"Atlanta, GA",56,1227454,989058,897836,1293127,701878,901042,888865,575834,659568,...,0,0,0,0,0,0,0,0,0,NaN
"Chicago, IL",1237623,190,964805,1480121,1921666,1144416,895274,639975,995254,910572,...,0,0,0,0,0,0,0,0,0,NaN
"Dallas/Fort Worth, TX",1016423,972014,530,1153797,840163,855128,666034,612910,655916,659250,...,0,0,0,0,0,0,0,0,0,NaN
"Los Angeles, CA",890942,1441189,1163039,0,1598786,952554,935741,320907,803514,1187661,...,0,0,0,0,0,0,0,0,0,NaN
"New York, NY",1297184,1907583,828679,1617983,696,589705,555443,995873,320654,553163,...,0,0,0,0,0,0,0,0,0,NaN

In [184]:
top_10 = grouped.ix[:10,:10]

In [186]:
top_10

DEST_CITY_NAME,"Atlanta, GA","Chicago, IL","Dallas/Fort Worth, TX","Los Angeles, CA","New York, NY","Denver, CO","Houston, TX","Charlotte, NC","Phoenix, AZ","Las Vegas, NV"
ORIGIN_CITY_NAME,,,,,,,,,,
"Atlanta, GA",56,1227454,989058,897836,1293127,701878,901042,888865,575834,659568
"Chicago, IL",1237623,190,964805,1480121,1921666,1144416,895274,639975,995254,910572
"Dallas/Fort Worth, TX",1016423,972014,530,1153797,840163,855128,666034,612910,655916,659250
"Los Angeles, CA",890942,1441189,1163039,0,1598786,952554,935741,320907,803514,1187661
"New York, NY",1297184,1907583,828679,1617983,696,589705,555443,995873,320654,553163
"Denver, CO",705150,1159791,860948,938658,590103,0,907665,297072,1102545,864486
"Houston, TX",917318,895659,679478,911712,556646,929020,0,460871,580698,649302
"Charlotte, NC",888889,651268,597424,335442,987189,303397,464947,0,484535,285709
"Phoenix, AZ",577818,1024415,667383,795035,319293,1072726,576931,498528,41,681931
"Las Vegas, NV",659989,932818,681608,1136116,549536,875879,659948,262282,688019,2428

In [189]:
colors = ['#9ACD32','#377DB8','#F5DEB3','#EE82EE','#40E0D0','#FF6347',
'#D8BFD8','#D2B48C','#4682B4','#00FF7F','#FFFAFA','#708090'
,'#708090'
,'#6A5ACD'
,'#87CEEB'
,'#A0522D'
,'#FFF5EE'
,'#2E8B57'
,'#F4A460'
,'#FA8072']

In [198]:
top_10_cities = top_10.columns.tolist()

In [199]:
top_10_cities

['Atlanta, GA',
 'Chicago, IL',
 'Dallas/Fort Worth, TX',
 'Los Angeles, CA',
 'New York, NY',
 'Denver, CO',
 'Houston, TX',
 'Charlotte, NC',
 'Phoenix, AZ',
 'Las Vegas, NV']

In [201]:
len(colors[:10])

10

In [203]:
cities = pd.DataFrame(top_10_cities, colors[:10])

In [204]:
cities

                             0
#9ACD32            Atlanta, GA
#377DB8            Chicago, IL
#F5DEB3  Dallas/Fort Worth, TX
#EE82EE        Los Angeles, CA
#40E0D0           New York, NY
#FF6347             Denver, CO
#D8BFD8            Houston, TX
#D2B48C          Charlotte, NC
#4682B4            Phoenix, AZ
#00FF7F          Las Vegas, NV